; domain
(define (domain wumpus_world)
    (:requirements :strips :typing)
    (:types pos crate wumpus arrow firework halfcrate pit) ; Define types for positions and crates
    (:predicates
        (agent-at ?pos - pos) ; Agent is at a position
        (crate-at ?crate - crate ?pos - pos) ; Crate is at a position
        (path ?from - pos ?to - pos) ; Path exists between positions
        (outside ?pos - pos) ; Position is outside the map (goal positions)
        (empty ?pos - pos) ; Position is empty
        (is_same_line ?pos1 - pos ?pos2 - pos) ; True if pos1 and pos2 are on the same line
        (wumpus-at ?wumpus - wumpus ?pos - pos);
        (arrow-at ?arrow - arrow ?pos - pos);
        (has-arrow);
        (firework-at ?firework - firework ?pos - pos);
        (walkable ?pos - pos); position is walkable
        (halfcrate-at ?halfcrate - halfcrate ?pos - pos);
        (firework-count-0);
        (firework-count-1);
        (firework-count-2);
        (firework-count-3);
        (pit-at ?pit - pit ?pos - pos) ; Predicate to represent the presence of a pit
        (filled ?pit - pit) ; Predicate to represent a filled pit
        (half-filled ?pit - pit) ; Predicate to represent a half-filled pit
        (empty-pit ?pit - pit)
    )

(:action move_firework
    :parameters (?from - pos ?to - pos ?firework - firework)
    :precondition (and 
        (agent-at ?from) 
        (path ?from ?to) 
        (firework-at ?firework ?to)
        (or (firework-count-0) (firework-count-1)(firework-count-2))
        (walkable ?to)
    )
    :effect (and 
        (not (agent-at ?from)) 
        (agent-at ?to)
        (not (firework-at ?firework ?to))
        (when (firework-count-0) (and (not (firework-count-0)) (firework-count-1)))
        (when (firework-count-1) (and (not (firework-count-1)) (firework-count-2)))
        (when (firework-count-2) (and (not (firework-count-2)) (firework-count-3)))
        (empty ?from)
        (walkable ?from)
    )
)

(:action move_arrow
    :parameters (?from - pos ?to - pos ?arrow - arrow)
    :precondition (and 
        (agent-at ?from) 
        (path ?from ?to) 
        (and (arrow-at ?arrow ?to) (not (has-arrow)))
        (walkable ?to)
        
    )
    :effect (and 

        (not (agent-at ?from)) 
        (agent-at ?to)
        (not (arrow-at ?arrow ?to))
        (has-arrow)
        (empty ?from)
        (walkable ?from)

    )
)

  (:action move
        :parameters (?from - pos ?to - pos)
        :precondition (and 
            (agent-at ?from) 
            (path ?from ?to) 
            (empty ?to)
            (walkable ?to)
        )
        :effect (and 
            (not (agent-at ?from)) 
            (agent-at ?to)
            (not (empty ?to)) 
            (empty ?from)
            (walkable ?from)
        )
    )

  (:action move_walkable
        :parameters (?from - pos ?to - pos)
        :precondition (and 
            (agent-at ?from) 
            (path ?from ?to) 
            (walkable ?to)
            (not (empty ?to))
        )
        :effect (and 
            (not (agent-at ?from)) 
            (agent-at ?to)
            (not (empty ?to)) 
            (walkable ?from)
        )
    )

    (:action push
        :parameters (?agent - pos ?from - pos ?to - pos ?crate - crate)
        :precondition (and 
            (agent-at ?agent) 
            (crate-at ?crate ?from) 
            (path ?agent ?from) 
            (path ?from ?to) 
            (empty ?to)
            (not (outside ?to))
            (is_same_line ?agent ?to) ; Ensure from and to are on the same line
        )

        :effect (and 
            (not (agent-at ?agent)) 
            (agent-at ?from) 
            (not (crate-at ?crate ?from)) 
            (crate-at ?crate ?to) 
            (empty ?agent) 
            (not (empty ?to))
            (walkable ?from)
            (not (walkable ?to))
        )
    )

          (:action push_halfcrate
        :parameters (?agent - pos ?from - pos ?to - pos ?halfcrate - halfcrate)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate ?from)
            (path ?agent ?from)
            (path ?from ?to)
            (empty ?to)
            (not (outside ?to))
            (is_same_line ?agent ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from)
            (not (halfcrate-at ?halfcrate ?from))
            (halfcrate-at ?halfcrate ?to)
            (empty ?agent)
            (not (empty ?to))
            (walkable ?from)
            (not (walkable ?to))
        )
    )

    (:action push_two_halfcrates
        :parameters (?agent - pos ?from1 - pos ?from2 - pos ?to - pos ?halfcrate1 - halfcrate ?halfcrate2 - halfcrate)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate1 ?from1)
            (halfcrate-at ?halfcrate2 ?from2)
            (path ?agent ?from1)
            (path ?from1 ?from2)
            (path ?from2 ?to)
            (empty ?to)
            (not (outside ?to))
            (is_same_line ?agent ?to)
            (is_same_line ?agent ?from2)
            (is_same_line ?agent ?from1)
            (walkable ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from1)
            (not (halfcrate-at ?halfcrate1 ?from1))
            (halfcrate-at ?halfcrate1 ?from2)
            (not (halfcrate-at ?halfcrate2 ?from2))
            (halfcrate-at ?halfcrate2 ?to)
            (empty ?agent)
            (not (empty ?to))
            (not (empty ?from2))
            (walkable ?from1)
            (not (walkable ?from2))
            (not (walkable ?to))
        )
    )


    (:action shoot
    :parameters (?from - pos ?to - pos ?wumpus - wumpus)
    :precondition (and 
        (agent-at ?from) 
        (wumpus-at ?wumpus ?to) 
        (has-arrow)
        (path ?from ?to) ; Assumes a direct line of sight from the agent to the Wumpus
    )

    :effect (and 
        (not (wumpus-at ?wumpus ?to)) ; The Wumpus is eliminated
        (not (has-arrow)) ; The agent uses the arrow
        (empty ?to) ; Explicitly mark the position as empty
        (walkable ?to);
    )
)
    (:action scare
        :parameters (?agent - pos ?from - pos ?to - pos ?wumpus - wumpus)
        :precondition (and 
            (agent-at ?agent)
            (not (agent-at ?from)) 
            (wumpus-at ?wumpus ?from) 
            (path ?agent ?from) 
            (path ?from ?to) 
            (or (firework-count-1) (firework-count-2)(firework-count-3))
            (walkable ?to)
            (not (outside ?to))
            (is_same_line ?agent ?to) ; Ensure from and to are on the same line
        )

        :effect (and 
            (agent-at ?agent)
            (not (wumpus-at ?wumpus ?from)) 
            (wumpus-at ?wumpus ?to) 
            (empty ?from)
            (not (empty ?to))
            (walkable ?from)
            (not (walkable ?to))
            (when (firework-count-3) (and (not(firework-count-3))(firework-count-2)))
            (when (firework-count-2) (and (not(firework-count-2))(firework-count-1)))
            (when (firework-count-1) (and (not(firework-count-1))(firework-count-0)))
        )
    )

    (:action push_crate_into_empty_pit
        :parameters (?agent - pos ?from - pos ?to - pos ?crate - crate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (crate-at ?crate ?from)
            (path ?agent ?from)
            (path ?from ?to)
            (pit-at ?pit ?to)
            (empty-pit ?pit)
            (is_same_line ?agent ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from)
            (not (crate-at ?crate ?from))
            (walkable ?from)
            (walkable ?to)
            (filled ?pit)
            (not (empty-pit ?pit))
            (empty ?agent)

        )
    )

    (:action push_halfcrate_into_empty_pit
        :parameters (?agent - pos ?from - pos ?to - pos ?halfcrate - halfcrate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate ?from)
            (path ?agent ?from)
            (path ?from ?to)
            (pit-at ?pit ?to)
            (empty-pit ?pit)
            (is_same_line ?agent ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from)
            (not (halfcrate-at ?halfcrate ?from))
            (half-filled ?pit)
            (not (empty-pit ?pit))
            (empty ?agent)
            (walkable ?from)
        )
    )

    (:action push_halfcrate_into_half_filled_pit
        :parameters (?agent - pos ?from - pos ?to - pos ?halfcrate - halfcrate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate ?from)
            (path ?agent ?from)
            (path ?from ?to)
            (pit-at ?pit ?to)
            (half-filled ?pit)
            (is_same_line ?agent ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from)
            (not (halfcrate-at ?halfcrate ?from))
            (filled ?pit)
            (not (half-filled ?pit))
            (empty ?agent)
            (walkable ?to)
            (walkable ?from)
        )
    )

    (:action push_crate_into_half_filled_pit
        :parameters (?agent - pos ?from - pos ?to - pos ?crate - crate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (crate-at ?crate ?from)
            (path ?agent ?from)
            (path ?from ?to)
            (pit-at ?pit ?to)
            (half-filled ?pit)
            (is_same_line ?agent ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from)
            (not (crate-at ?crate ?from))
            (not (half-filled ?pit))
            (not (walkable ?to))
            (empty ?agent)
            (walkable ?from)
        )
    )

        (:action push_two_halfcrates_into_empty_pit
        :parameters (?agent - pos ?from1 - pos ?from2 - pos ?to - pos ?halfcrate1 - halfcrate ?halfcrate2 - halfcrate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate1 ?from1)
            (halfcrate-at ?halfcrate2 ?from2)
            (path ?agent ?from1)
            (path ?from1 ?from2)
            (path ?from2 ?to)
            (pit-at ?pit ?to)
            (empty-pit ?pit)
            (is_same_line ?agent ?to)
            (is_same_line ?agent ?from2)
            (is_same_line ?agent ?from1)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from1)
            (not (halfcrate-at ?halfcrate1 ?from1))
            (halfcrate-at ?halfcrate1 ?from2)
            (not (halfcrate-at ?halfcrate2 ?from2))
            (empty ?agent)
            (not (empty ?to))
            (half-filled ?pit)
            (not (empty-pit ?pit))
        )
    )

    (:action push_two_halfcrates_into_half_filled_pit
        :parameters (?agent - pos ?from1 - pos ?from2 - pos ?to - pos ?halfcrate1 - halfcrate ?halfcrate2 - halfcrate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate1 ?from1)
            (halfcrate-at ?halfcrate2 ?from2)
            (path ?agent ?from1)
            (path ?from1 ?from2)
            (path ?from2 ?to)
            (pit-at ?pit ?to)
            (half-filled ?pit)
            (is_same_line ?agent ?to)
            (is_same_line ?agent ?from2)
            (is_same_line ?agent ?from1)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from1)
            (not (halfcrate-at ?halfcrate1 ?from1))
            (halfcrate-at ?halfcrate1 ?from2)
            (not (halfcrate-at ?halfcrate2 ?from2))
            (empty ?agent)
            (not (empty ?to))
            (not(half-filled ?pit))
            (filled ?pit)
            (not (empty-pit ?pit))
            (walkable ?to)
        )
    )

    )

; problem
(define (problem simple_escape)
    (:domain wumpus_world)
    (:objects
        p3_0 p5_0 p6_0 p7_0 p9_0 p11_0 p0_1 p1_1 p5_1 p6_1 p7_1 p8_1 p0_2 p1_2 p6_2 p11_2 p1_3 p2_3 p3_3 p4_3 p5_3 p1_4 p4_4 p5_4 p6_4 p9_4 p1_5 p5_5 p1_6 p2_6 p9_6 p0_7 p2_7 p9_7 p0_8 p2_8 p3_-1 p5_-1 p6_-1 p7_-1 p9_-1 p9_8 p11_-1 p12_0 p-1_1 p-1_2 p12_2 p-1_7 - pos
         - crate
         - wumpus
         - arrow
         - firework
         - halfcrate
         - pit

    )
    (:init
        (agent-at p6_4)
        (firework-count-0);
        
        (path p5_0 p6_0) (path p6_0 p5_0) (path p5_0 p5_1) (path p5_1 p5_0) (path p6_0 p7_0) (path p7_0 p6_0) (path p6_0 p6_1) (path p6_1 p6_0) (path p7_0 p7_1) (path p7_1 p7_0) (path p0_1 p1_1) (path p1_1 p0_1) (path p0_1 p0_2) (path p0_2 p0_1) (path p1_1 p1_2) (path p1_2 p1_1) (path p5_1 p6_1) (path p6_1 p5_1) (path p6_1 p7_1) (path p7_1 p6_1) (path p6_1 p6_2) (path p6_2 p6_1) (path p7_1 p8_1) (path p8_1 p7_1) (path p0_2 p1_2) (path p1_2 p0_2) (path p1_2 p1_3) (path p1_3 p1_2) (path p1_3 p2_3) (path p2_3 p1_3) (path p1_3 p1_4) (path p1_4 p1_3) (path p2_3 p3_3) (path p3_3 p2_3) (path p3_3 p4_3) (path p4_3 p3_3) (path p4_3 p5_3) (path p5_3 p4_3) (path p4_3 p4_4) (path p4_4 p4_3) (path p5_3 p5_4) (path p5_4 p5_3) (path p1_4 p1_5) (path p1_5 p1_4) (path p4_4 p5_4) (path p5_4 p4_4) (path p5_4 p6_4) (path p6_4 p5_4) (path p5_4 p5_5) (path p5_5 p5_4) (path p1_5 p1_6) (path p1_6 p1_5) (path p1_6 p2_6) (path p2_6 p1_6) (path p2_6 p2_7) (path p2_7 p2_6) (path p9_6 p9_7) (path p9_7 p9_6) (path p0_7 p0_8) (path p2_7 p2_8) (path p3_0 p3_-1) (path p5_0 p5_-1) (path p6_0 p6_-1) (path p7_0 p7_-1) (path p9_0 p9_-1) (path p9_7 p9_8) (path p11_0 p11_-1) (path p11_0 p12_0) (path p0_1 p-1_1) (path p0_2 p-1_2) (path p11_2 p12_2) (path p0_7 p-1_7)
        
        
        
        
        (empty p3_0) (empty p5_0) (empty p6_0) (empty p7_0) (empty p9_0) (empty p11_0) (empty p0_1) (empty p1_1) (empty p5_1) (empty p6_1) (empty p7_1) (empty p8_1) (empty p0_2) (empty p1_2) (empty p6_2) (empty p11_2) (empty p1_3) (empty p2_3) (empty p3_3) (empty p4_3) (empty p5_3) (empty p1_4) (empty p4_4) (empty p5_4) (empty p9_4) (empty p1_5) (empty p5_5) (empty p1_6) (empty p2_6) (empty p9_6) (empty p0_7) (empty p2_7) (empty p9_7)
        (empty p0_8) (empty p2_8) (empty p3_-1) (empty p5_-1) (empty p6_-1) (empty p7_-1) (empty p9_-1) (empty p9_8) (empty p11_-1) (empty p12_0) (empty p-1_1) (empty p-1_2) (empty p12_2) (empty p-1_7)
        (outside p0_8) (outside p2_8) (outside p3_-1) (outside p5_-1) (outside p6_-1) (outside p7_-1) (outside p9_-1) (outside p9_8) (outside p11_-1) (outside p12_0) (outside p-1_1) (outside p-1_2) (outside p12_2) (outside p-1_7)
        (walkable p3_0) (walkable p5_0) (walkable p6_0) (walkable p7_0) (walkable p9_0) (walkable p11_0) (walkable p0_1) (walkable p1_1) (walkable p5_1) (walkable p6_1) (walkable p7_1) (walkable p8_1) (walkable p0_2) (walkable p1_2) (walkable p6_2) (walkable p11_2) (walkable p1_3) (walkable p2_3) (walkable p3_3) (walkable p4_3) (walkable p5_3) (walkable p1_4) (walkable p4_4) (walkable p5_4) (walkable p9_4) (walkable p1_5) (walkable p5_5) (walkable p1_6) (walkable p2_6) (walkable p9_6) (walkable p0_7) (walkable p2_7) (walkable p9_7)
        (walkable p0_8) (walkable p2_8) (walkable p3_-1) (walkable p5_-1) (walkable p6_-1) (walkable p7_-1) (walkable p9_-1) (walkable p9_8) (walkable p11_-1) (walkable p12_0) (walkable p-1_1) (walkable p-1_2) (walkable p12_2) (walkable p-1_7)
        
        
        
        
        (is_same_line p3_0 p5_0) (is_same_line p3_0 p6_0) (is_same_line p3_0 p7_0) (is_same_line p3_0 p9_0) (is_same_line p3_0 p11_0) (is_same_line p3_0 p3_3) (is_same_line p3_0 p3_-1) (is_same_line p3_0 p12_0) (is_same_line p5_0 p3_0) (is_same_line p5_0 p6_0) (is_same_line p5_0 p7_0) (is_same_line p5_0 p9_0) (is_same_line p5_0 p11_0) (is_same_line p5_0 p5_1) (is_same_line p5_0 p5_3) (is_same_line p5_0 p5_4) (is_same_line p5_0 p5_5) (is_same_line p5_0 p5_-1) (is_same_line p5_0 p12_0) (is_same_line p6_0 p3_0) (is_same_line p6_0 p5_0) (is_same_line p6_0 p7_0) (is_same_line p6_0 p9_0) (is_same_line p6_0 p11_0) (is_same_line p6_0 p6_1) (is_same_line p6_0 p6_2) (is_same_line p6_0 p6_4) (is_same_line p6_0 p6_-1) (is_same_line p6_0 p12_0) (is_same_line p7_0 p3_0) (is_same_line p7_0 p5_0) (is_same_line p7_0 p6_0) (is_same_line p7_0 p9_0) (is_same_line p7_0 p11_0) (is_same_line p7_0 p7_1) (is_same_line p7_0 p7_-1) (is_same_line p7_0 p12_0) (is_same_line p9_0 p3_0) (is_same_line p9_0 p5_0) (is_same_line p9_0 p6_0) (is_same_line p9_0 p7_0) (is_same_line p9_0 p11_0) (is_same_line p9_0 p9_4) (is_same_line p9_0 p9_6) (is_same_line p9_0 p9_7) (is_same_line p9_0 p9_-1) (is_same_line p9_0 p9_8) (is_same_line p9_0 p12_0) (is_same_line p11_0 p3_0) (is_same_line p11_0 p5_0) (is_same_line p11_0 p6_0) (is_same_line p11_0 p7_0) (is_same_line p11_0 p9_0) (is_same_line p11_0 p11_2) (is_same_line p11_0 p11_-1) (is_same_line p11_0 p12_0) (is_same_line p0_1 p1_1) (is_same_line p0_1 p5_1) (is_same_line p0_1 p6_1) (is_same_line p0_1 p7_1) (is_same_line p0_1 p8_1) (is_same_line p0_1 p0_2) (is_same_line p0_1 p0_7) (is_same_line p0_1 p0_8) (is_same_line p0_1 p-1_1) (is_same_line p1_1 p0_1) (is_same_line p1_1 p5_1) (is_same_line p1_1 p6_1) (is_same_line p1_1 p7_1) (is_same_line p1_1 p8_1) (is_same_line p1_1 p1_2) (is_same_line p1_1 p1_3) (is_same_line p1_1 p1_4) (is_same_line p1_1 p1_5) (is_same_line p1_1 p1_6) (is_same_line p1_1 p-1_1) (is_same_line p5_1 p5_0) (is_same_line p5_1 p0_1) (is_same_line p5_1 p1_1) (is_same_line p5_1 p6_1) (is_same_line p5_1 p7_1) (is_same_line p5_1 p8_1) (is_same_line p5_1 p5_3) (is_same_line p5_1 p5_4) (is_same_line p5_1 p5_5) (is_same_line p5_1 p5_-1) (is_same_line p5_1 p-1_1) (is_same_line p6_1 p6_0) (is_same_line p6_1 p0_1) (is_same_line p6_1 p1_1) (is_same_line p6_1 p5_1) (is_same_line p6_1 p7_1) (is_same_line p6_1 p8_1) (is_same_line p6_1 p6_2) (is_same_line p6_1 p6_4) (is_same_line p6_1 p6_-1) (is_same_line p6_1 p-1_1) (is_same_line p7_1 p7_0) (is_same_line p7_1 p0_1) (is_same_line p7_1 p1_1) (is_same_line p7_1 p5_1) (is_same_line p7_1 p6_1) (is_same_line p7_1 p8_1) (is_same_line p7_1 p7_-1) (is_same_line p7_1 p-1_1) (is_same_line p8_1 p0_1) (is_same_line p8_1 p1_1) (is_same_line p8_1 p5_1) (is_same_line p8_1 p6_1) (is_same_line p8_1 p7_1) (is_same_line p8_1 p-1_1) (is_same_line p0_2 p0_1) (is_same_line p0_2 p1_2) (is_same_line p0_2 p6_2) (is_same_line p0_2 p11_2) (is_same_line p0_2 p0_7) (is_same_line p0_2 p0_8) (is_same_line p0_2 p-1_2) (is_same_line p0_2 p12_2) (is_same_line p1_2 p1_1) (is_same_line p1_2 p0_2) (is_same_line p1_2 p6_2) (is_same_line p1_2 p11_2) (is_same_line p1_2 p1_3) (is_same_line p1_2 p1_4) (is_same_line p1_2 p1_5) (is_same_line p1_2 p1_6) (is_same_line p1_2 p-1_2) (is_same_line p1_2 p12_2) (is_same_line p6_2 p6_0) (is_same_line p6_2 p6_1) (is_same_line p6_2 p0_2) (is_same_line p6_2 p1_2) (is_same_line p6_2 p11_2) (is_same_line p6_2 p6_4) (is_same_line p6_2 p6_-1) (is_same_line p6_2 p-1_2) (is_same_line p6_2 p12_2) (is_same_line p11_2 p11_0) (is_same_line p11_2 p0_2) (is_same_line p11_2 p1_2) (is_same_line p11_2 p6_2) (is_same_line p11_2 p11_-1) (is_same_line p11_2 p-1_2) (is_same_line p11_2 p12_2) (is_same_line p1_3 p1_1) (is_same_line p1_3 p1_2) (is_same_line p1_3 p2_3) (is_same_line p1_3 p3_3) (is_same_line p1_3 p4_3) (is_same_line p1_3 p5_3) (is_same_line p1_3 p1_4) (is_same_line p1_3 p1_5) (is_same_line p1_3 p1_6) (is_same_line p2_3 p1_3) (is_same_line p2_3 p3_3) (is_same_line p2_3 p4_3) (is_same_line p2_3 p5_3) (is_same_line p2_3 p2_6) (is_same_line p2_3 p2_7) (is_same_line p2_3 p2_8) (is_same_line p3_3 p3_0) (is_same_line p3_3 p1_3) (is_same_line p3_3 p2_3) (is_same_line p3_3 p4_3) (is_same_line p3_3 p5_3) (is_same_line p3_3 p3_-1) (is_same_line p4_3 p1_3) (is_same_line p4_3 p2_3) (is_same_line p4_3 p3_3) (is_same_line p4_3 p5_3) (is_same_line p4_3 p4_4) (is_same_line p5_3 p5_0) (is_same_line p5_3 p5_1) (is_same_line p5_3 p1_3) (is_same_line p5_3 p2_3) (is_same_line p5_3 p3_3) (is_same_line p5_3 p4_3) (is_same_line p5_3 p5_4) (is_same_line p5_3 p5_5) (is_same_line p5_3 p5_-1) (is_same_line p1_4 p1_1) (is_same_line p1_4 p1_2) (is_same_line p1_4 p1_3) (is_same_line p1_4 p4_4) (is_same_line p1_4 p5_4) (is_same_line p1_4 p6_4) (is_same_line p1_4 p9_4) (is_same_line p1_4 p1_5) (is_same_line p1_4 p1_6) (is_same_line p4_4 p4_3) (is_same_line p4_4 p1_4) (is_same_line p4_4 p5_4) (is_same_line p4_4 p6_4) (is_same_line p4_4 p9_4) (is_same_line p5_4 p5_0) (is_same_line p5_4 p5_1) (is_same_line p5_4 p5_3) (is_same_line p5_4 p1_4) (is_same_line p5_4 p4_4) (is_same_line p5_4 p6_4) (is_same_line p5_4 p9_4) (is_same_line p5_4 p5_5) (is_same_line p5_4 p5_-1) (is_same_line p6_4 p6_0) (is_same_line p6_4 p6_1) (is_same_line p6_4 p6_2) (is_same_line p6_4 p1_4) (is_same_line p6_4 p4_4) (is_same_line p6_4 p5_4) (is_same_line p6_4 p9_4) (is_same_line p6_4 p6_-1) (is_same_line p9_4 p9_0) (is_same_line p9_4 p1_4) (is_same_line p9_4 p4_4) (is_same_line p9_4 p5_4) (is_same_line p9_4 p6_4) (is_same_line p9_4 p9_6) (is_same_line p9_4 p9_7) (is_same_line p9_4 p9_-1) (is_same_line p9_4 p9_8) (is_same_line p1_5 p1_1) (is_same_line p1_5 p1_2) (is_same_line p1_5 p1_3) (is_same_line p1_5 p1_4) (is_same_line p1_5 p5_5) (is_same_line p1_5 p1_6) (is_same_line p5_5 p5_0) (is_same_line p5_5 p5_1) (is_same_line p5_5 p5_3) (is_same_line p5_5 p5_4) (is_same_line p5_5 p1_5) (is_same_line p5_5 p5_-1) (is_same_line p1_6 p1_1) (is_same_line p1_6 p1_2) (is_same_line p1_6 p1_3) (is_same_line p1_6 p1_4) (is_same_line p1_6 p1_5) (is_same_line p1_6 p2_6) (is_same_line p1_6 p9_6) (is_same_line p2_6 p2_3) (is_same_line p2_6 p1_6) (is_same_line p2_6 p9_6) (is_same_line p2_6 p2_7) (is_same_line p2_6 p2_8) (is_same_line p9_6 p9_0) (is_same_line p9_6 p9_4) (is_same_line p9_6 p1_6) (is_same_line p9_6 p2_6) (is_same_line p9_6 p9_7) (is_same_line p9_6 p9_-1) (is_same_line p9_6 p9_8) (is_same_line p0_7 p0_1) (is_same_line p0_7 p0_2) (is_same_line p0_7 p2_7) (is_same_line p0_7 p9_7) (is_same_line p0_7 p0_8) (is_same_line p0_7 p-1_7) (is_same_line p2_7 p2_3) (is_same_line p2_7 p2_6) (is_same_line p2_7 p0_7) (is_same_line p2_7 p9_7) (is_same_line p2_7 p2_8) (is_same_line p2_7 p-1_7) (is_same_line p9_7 p9_0) (is_same_line p9_7 p9_4) (is_same_line p9_7 p9_6) (is_same_line p9_7 p0_7) (is_same_line p9_7 p2_7) (is_same_line p9_7 p9_-1) (is_same_line p9_7 p9_8) (is_same_line p9_7 p-1_7) (is_same_line p0_8 p0_1) (is_same_line p0_8 p0_2) (is_same_line p0_8 p0_7) (is_same_line p0_8 p2_8) (is_same_line p0_8 p9_8) (is_same_line p2_8 p2_3) (is_same_line p2_8 p2_6) (is_same_line p2_8 p2_7) (is_same_line p2_8 p0_8) (is_same_line p2_8 p9_8) (is_same_line p3_-1 p3_0) (is_same_line p3_-1 p3_3) (is_same_line p3_-1 p5_-1) (is_same_line p3_-1 p6_-1) (is_same_line p3_-1 p7_-1) (is_same_line p3_-1 p9_-1) (is_same_line p3_-1 p11_-1) (is_same_line p5_-1 p5_0) (is_same_line p5_-1 p5_1) (is_same_line p5_-1 p5_3) (is_same_line p5_-1 p5_4) (is_same_line p5_-1 p5_5) (is_same_line p5_-1 p3_-1) (is_same_line p5_-1 p6_-1) (is_same_line p5_-1 p7_-1) (is_same_line p5_-1 p9_-1) (is_same_line p5_-1 p11_-1) (is_same_line p6_-1 p6_0) (is_same_line p6_-1 p6_1) (is_same_line p6_-1 p6_2) (is_same_line p6_-1 p6_4) (is_same_line p6_-1 p3_-1) (is_same_line p6_-1 p5_-1) (is_same_line p6_-1 p7_-1) (is_same_line p6_-1 p9_-1) (is_same_line p6_-1 p11_-1) (is_same_line p7_-1 p7_0) (is_same_line p7_-1 p7_1) (is_same_line p7_-1 p3_-1) (is_same_line p7_-1 p5_-1) (is_same_line p7_-1 p6_-1) (is_same_line p7_-1 p9_-1) (is_same_line p7_-1 p11_-1) (is_same_line p9_-1 p9_0) (is_same_line p9_-1 p9_4) (is_same_line p9_-1 p9_6) (is_same_line p9_-1 p9_7) (is_same_line p9_-1 p3_-1) (is_same_line p9_-1 p5_-1) (is_same_line p9_-1 p6_-1) (is_same_line p9_-1 p7_-1) (is_same_line p9_-1 p9_8) (is_same_line p9_-1 p11_-1) (is_same_line p9_8 p9_0) (is_same_line p9_8 p9_4) (is_same_line p9_8 p9_6) (is_same_line p9_8 p9_7) (is_same_line p9_8 p0_8) (is_same_line p9_8 p2_8) (is_same_line p9_8 p9_-1) (is_same_line p11_-1 p11_0) (is_same_line p11_-1 p11_2) (is_same_line p11_-1 p3_-1) (is_same_line p11_-1 p5_-1) (is_same_line p11_-1 p6_-1) (is_same_line p11_-1 p7_-1) (is_same_line p11_-1 p9_-1) (is_same_line p12_0 p3_0) (is_same_line p12_0 p5_0) (is_same_line p12_0 p6_0) (is_same_line p12_0 p7_0) (is_same_line p12_0 p9_0) (is_same_line p12_0 p11_0) (is_same_line p12_0 p12_2) (is_same_line p-1_1 p0_1) (is_same_line p-1_1 p1_1) (is_same_line p-1_1 p5_1) (is_same_line p-1_1 p6_1) (is_same_line p-1_1 p7_1) (is_same_line p-1_1 p8_1) (is_same_line p-1_1 p-1_2) (is_same_line p-1_1 p-1_7) (is_same_line p-1_2 p0_2) (is_same_line p-1_2 p1_2) (is_same_line p-1_2 p6_2) (is_same_line p-1_2 p11_2) (is_same_line p-1_2 p-1_1) (is_same_line p-1_2 p12_2) (is_same_line p-1_2 p-1_7) (is_same_line p12_2 p0_2) (is_same_line p12_2 p1_2) (is_same_line p12_2 p6_2) (is_same_line p12_2 p11_2) (is_same_line p12_2 p12_0) (is_same_line p12_2 p-1_2) (is_same_line p-1_7 p0_7) (is_same_line p-1_7 p2_7) (is_same_line p-1_7 p9_7) (is_same_line p-1_7 p-1_1) (is_same_line p-1_7 p-1_2)
    )
    (:goal
        (or (agent-at p0_8) (agent-at p2_8) (agent-at p3_-1) (agent-at p5_-1) (agent-at p6_-1) (agent-at p7_-1) (agent-at p9_-1) (agent-at p9_8) (agent-at p11_-1) (agent-at p12_0) (agent-at p-1_1) (agent-at p-1_2) (agent-at p12_2) (agent-at p-1_7))
    )
)

; plan
1. (move p6_4 p5_4)
   deleted: (agent-at p6_4) (empty p5_4)
   added: (agent-at p5_4) (empty p6_4) (walkable p6_4)
   goals met: 0 of 1
2. (move p5_4 p4_4)
   deleted: (agent-at p5_4) (empty p4_4)
   added: (agent-at p4_4) (empty p5_4)
   goals met: 0 of 1
3. (move p4_4 p4_3)
   deleted: (agent-at p4_4) (empty p4_3)
   added: (agent-at p4_3) (empty p4_4)
   goals met: 0 of 1
4. (move p4_3 p3_3)
   deleted: (agent-at p4_3) (empty p3_3)
   added: (agent-at p3_3) (empty p4_3)
   goals met: 0 of 1
5. (move p3_3 p2_3)
   deleted: (agent-at p3_3) (empty p2_3)
   added: (agent-at p2_3) (empty p3_3)
   goals met: 0 of 1
6. (move p2_3 p1_3)
   deleted: (agent-at p2_3) (empty p1_3)
   added: (agent-at p1_3) (empty p2_3)
   goals met: 0 of 1
7. (move p1_3 p1_2)
   deleted: (agent-at p1_3) (empty p1_2)
   added: (agent-at p1_2) (empty p1_3)
   goals met: 0 of 1
8. (move p1_2 p0_2)
   deleted: (agent-at p1_2) (empty p0_2)
   added: (agent-at p0_2) (empty p1_2)
   goals met: 0 of 1
9. (move p0_2 p-1_2)
   deleted: (agent-at p0_2) (empty p-1_2)
   added: (agent-at p-1_2) (empty p0_2)
   goals met: 1 of 1
